Repository: Vandal166/Boardis
Catalog: src/Web.Resources/Resources/Boards/BoardResources.*.resx
Languages: pl

# TitleRequired
source: Title is required.
pl: Tytuł jest wymagany.

# TitleMaxLength
source: Title cannot exceed {0} characters.
pl: Tytuł nie może przekraczać {0} znaków.

# DescriptionMaxLength
source: Description cannot exceed {0} characters.
pl: Opis nie może przekraczać {0} znaków.

# OwnerIdRequired
source: Owner ID is required.
pl: Identyfikator właściciela jest wymagany.

# OwnerIdNotEmptyGuid
source: Owner ID cannot be an empty GUID.
pl: Identyfikator właściciela nie może być pustym GUID-em.

# OwnerIdUserNotExist
source: User with the specified Owner ID does not exist.
pl: Użytkownik o podanym identyfikatorze właściciela nie istnieje.

# BoardIdRequired
source: Board ID is required.
pl: Identyfikator tablicy jest wymagany.

# BoardIdNotEmptyGuid
source: Board ID cannot be an empty GUID.
pl: Identyfikator tablicy nie może być pustym GUID-em.

# RequestingUserIdRequired
source: Requesting User ID is required.
pl: Identyfikator żądającego użytkownika jest wymagany.

# RequestingUserIdNotEmptyGuid
source: Requesting User ID cannot be an empty GUID.
pl: Identyfikator żądającego użytkownika nie może być pustym GUID-em.

# RequestingUserIdUserNotExist
source: User with the given Requesting User ID does not exist.
pl: Użytkownik o podanym identyfikatorze żądającego nie istnieje.

# VisibilityRequired
source: Visibility cannot be null.
pl: Widoczność nie może być pusta.

# VisibilityInvalid
source: Invalid visibility level.
pl: Nieprawidłowy poziom widoczności.

# FileRequired
source: File is required.
pl: Plik jest wymagany.

# FileNotEmpty
source: File cannot be empty.
pl: Plik nie może być pusty.

# FileMaxSize
source: File size cannot exceed {0} MB.
pl: Rozmiar pliku nie może przekraczać {0} MB.

# FileTypeInvalid
source: Unsupported file type. Allowed types are: JPEG, PNG, GIF.
pl: Nieobsługiwany typ pliku. Dozwolone typy: JPEG, PNG, GIF.

source: Board not found.
pl: Tablica nie znaleziona.

# BoardDeleteNotOwner
source: Only the owner can delete the board.
pl: Tylko właściciel może usunąć tablicę.

source: Title cannot be null.
pl: Tytuł nie może być pusty.

source: Visibility cannot be null.
pl: Widoczność nie może być pusta.

source: List not found.
pl: Lista nie znaleziona.

# NotMemberOfBoard
source: You are not a member of this board.
pl: Nie jesteś członkiem tej tablicy.

# OwnerCannotLeaveBoard
source: The owner cannot leave the board. Delete it instead.
pl: Właściciel nie może opuścić tablicy. Usuń ją zamiast tego.

# UserIsMemberAlready
source: User is already a member of this board.
pl: Użytkownik jest już członkiem tej tablicy.

source: Member not found.
pl: Członek nie znaleziony.

# CannotRemoveOwner
source: Cannot remove the owner of the board.
pl: Nie można usunąć właściciela tablicy.

# CannotRemoveSelf
source: You cannot remove yourself from the board.
pl: Nie możesz usunąć siebie z tablicy.

# OnlyMembersCanSetWallpaper
source: Only board members can set the wallpaper image.
pl: Tylko członkowie tablicy mogą ustawić obraz tła.

# OnlyMembersCanDeleteWallpaper
source: Only board members can delete the wallpaper image.
pl: Tylko członkowie tablicy mogą usunąć obraz tła.

# NoWallpaperToDelete
source: No wallpaper image to delete.
pl: Brak obrazu tła do usunięcia.

# TitleInvalid
source: Title is invalid.
pl: Tytuł jest nieprawidłowy.

# DescriptionTooLong
source: Description cannot exceed 500 characters.
pl: Opis nie może przekraczać 500 znaków.

source: Position cannot be null.
pl: Pozycja nie może być pusta.

source: Card not found.
pl: Karta nie znaleziona.

# PositionMustBeNonNegative
source: Position must be a non-negative.
pl: Pozycja musi być nieujemna.

source: Invalid color ARGB value.
pl: Nieprawidłowa wartość ARGB koloru.

# ListIdRequired
source: List ID cannot be empty.
pl: Identyfikator listy nie może być pusty.

# CompletedAtCannotBeInFuture
source: CompletedAt cannot be in the future.
pl: Data zakończenia nie może być w przyszłości.

# UserIdRequired
source: User ID cannot be empty.
pl: Identyfikator użytkownika nie może być pusty.

# RoleIdRequired
source: Assign a role to the member.
pl: Przypisz rolę członkowi.

# NoNewPermissionsAdded
source: No new permissions were added.
pl: Nie dodano żadnych nowych uprawnień.

# MemberDoesNotHavePermission
source: The member does not have the specified permission.
pl: Członek nie posiada określonego uprawnienia.

# CannotRemoveLastPermission
source: Cannot remove the last permission from a member.
pl: Nie można usunąć ostatniego uprawnienia członka.

# BoardListIdRequired
source: Board List ID is required.
pl: Identyfikator listy tablicy jest wymagany.

# BoardListIdNotEmptyGuid
source: Board List ID cannot be an empty GUID.
pl: Identyfikator listy tablicy nie może być pustym GUID-em.

# PositionGreaterThanZero
source: Position must be greater than zero.
pl: Pozycja musi być większa od zera.

# UserIdNotEmptyGuid
source: User ID cannot be an empty GUID.
pl: Identyfikator użytkownika nie może być pustym GUID-em.

# UserIdToAddUserNotExist
source: User to add does not exist.
pl: Użytkownik do dodania nie istnieje.

# CardIdRequired
source: Card ID is required.
pl: Identyfikator karty jest wymagany.

# CardIdNotEmptyGuid
source: Card ID cannot be an empty GUID.
pl: Identyfikator karty nie może być pustym GUID-em.

source: Media not found
pl: Nie znaleziono pliku.

# MemberIdRequired
source: Member ID is required.
pl: Identyfikator członka jest wymagany.

# PermissionRequired
source: Permission is required.
pl: Uprawnienie jest wymagane.

# OnlyOwnerCanAddPermissions
source: Only the board owner can add permissions to members.
pl: Tylko właściciel tablicy może dodawać uprawnienia członkom.

# OnlyOwnerCanRemovePermissions
source: Only the board owner can remove permissions from members.
pl: Tylko właściciel tablicy może usuwać uprawnienia członkom.

# MemberNotFoundOnBoard
source: The specified member does not belong to the board.
pl: Podany członek nie należy do tablicy.

# CannotRemoveOwnPermissions
source: You cannot remove permissions from yourself.
pl: Nie możesz usuwać uprawnień samemu sobie.

# FailedToUploadBlob
source: Failed to upload file to blob storage.
pl: Nie udało się przesłać pliku do magazynu blob.

# FailedToDownloadBlob
source: Failed to download file from blob storage.
pl: Nie udało się pobrać pliku z magazynu blob.

# BlobFileNotFound
source: File not found in blob storage.
pl: Nie znaleziono pliku w magazynie blob.

# UnexpectedBlobDownloadError
source: An unexpected error occurred while downloading the file from blob storage.
pl: Wystąpił nieoczekiwany błąd podczas pobierania pliku z magazynu blob.

# BoardIdNotInRoute
source: Board ID is missing or invalid in route.
pl: Brak lub nieprawidłowy identyfikator tablicy w ścieżce żądania.

# UserPermissionsNotFound
source: Could not retrieve user permissions.
pl: Nie można pobrać uprawnień użytkownika.

# MissingRequiredPermission
source: You lack the required permission for this action.
pl: Brakuje wymaganego uprawnienia do wykonania tej akcji.

# UserIdInvalid
source: User ID is invalid.
pl: Identyfikator użytkownika jest nieprawidłowy.

# UsernameInvalid
source: Username is invalid.
pl: Nazwa użytkownika jest nieprawidłowa.

# EmailInvalid
source: Email is invalid.
pl: Adres e-mail jest nieprawidłowy.

# NotificationBoardInviteTitle
source: You have been invited to a board
pl: Zostałeś zaproszony do tablicy

# NotificationBoardRemovedTitle
source: You have been removed from the board
pl: Zostałeś usunięty z tablicy
